settings = {
    1: {
        'params': ['Источник', 'Тип устройства'],
        'metrics': ['Количество страниц',]
    },

    2: {
        'params': ['Источник'],
        'metrics': ['Успешно']
    },

    3: {
        'params': None,
        'metrics': ['Сумма заказа']
    },

    4: {
        'params': None,
        'metrics': ['Сумма заказа']
    }
}

full_settings = {
    1: {
        'params': ['Источник', 'Тип устройства'],
        'metrics': ['Количество страниц', 'Успешно', 'Сумма заказа'],
    },

    2: {
        'params': ['Источник', 'Тип устройства'],
        'metrics': ['Количество страниц', 'Успешно', 'Сумма заказа'],
    },

    3: {
        'params': ['Источник', 'Тип устройства'],
        'metrics': ['Количество страниц', 'Успешно', 'Сумма заказа'],
    },

    4: {
        'params': ['Источник', 'Тип устройства'],
        'metrics': ['Количество страниц', 'Успешно', 'Сумма заказа'],
    }
}